<?php


$city = [
    [11, 'Нью-Йорк',   'Нью-Йорк'],
    [9, 'Калифорния',   'Лос-Анджелес'],
    [8, 'Иллинойс',   'Чикаго'],
    [7, 'Техас',   'Хьюстон'],
    [6, 'Пенсильвания',   'Филадельфия'],
    [5, 'Аризона',   'Феникс'],
    [4, 'Техас',   'Сан-Антонио'],
    [3, 'Калифорния',   'Диего'],
    [2, 'Техас',   'Даллас'],
    [1, 'Калифорния',   'Хосе']
];

//sort($city);

function($a, $b) {

    if ($a[1] = $b[1])
        print 
};

echo '<br>';

for ($i = 0, $num_specials = count($city); $i < $num_specials; $i++) {
    echo '<tr> <td>';
    for ($m = 0, $num_sub = count($city[$i]); $m < $num_sub; $m++) {
        print $city[$i][$m] . "\n ";
    }
    echo '</tr> </td> <br>';
}

echo '<br>';

